{
  "email": "smartsdlc.dev@gmail.com",
  "birthDate": "1985-05-08",
  "country": "Belgium",
  "summary": "Whether it's as a Software Engineer, Tech Lead, or Architect, if it involves software development, I'm in!\n\nMy journey began 19 years ago in Java development before transitioning fully into the dynamic world of JavaScript/TypeScript and its powerful ecosystem. Now, I unify diverse technologies to enable seamless full-stack development, ensuring systems work efficiently and scale effortlessly.\n\nI support companies through their software development cycle challenges by utilizing Nx monorepos, micro frontends, robust testing strategies, and a touch of Extreme Programming philosophy.\n\nEvery day for me is like waiting for the next episode of my favorite series—filled with learning, sharing, and growing together. Indeed, I'm as passionate about coaching and sharing knowledge as I am about coding.\n\nI am the father of two incredible boys, and I am endlessly grateful to my wife for supporting my passion every day.",
  "education": [
    {
      "institution": "HEB (ESI)",
      "studyType": "Bachelor in IT Science",
      "startDate": "2003-09-01",
      "endDate": "2006-06-30",
      "location": "Brussels, Belgium"
    },
    {
      "institution": "COLLEGE ST VINCENT",
      "studyType": "SECONDARY SCHOOL CERTIFICATE (CESS)",
      "startDate": "2000-09-01",
      "endDate": "2003-06-30",
      "location": "Soignies, Belgium"
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Fluent"
    },
    {
      "language": "French",
      "fluency": "Native speaker"
    }
  ],
  "experiences": [
    {
      "role": "Nx Consultant & Software Development Acceleration",
      "companyName": "Julius Baer",
      "companyLogo": "/companies/julius-baer.jpeg",
      "companyURL": "https://www.linkedin.com/company/julius-baer/",
      "location": "Remote",
      "description": "Partnered with the Software Development Acceleration department to streamline and modernize the Software Development Lifecycle across a large distributed repositories ecosystem. My work focused on introducing a scalable architecture powered by Nx, improving consistency, performance, and developer experience across dozens of heterogeneous codebases, while also bringing AI-assisted tooling into key engineering workflows.",
      "startDate": "2025-03-01",
      "endDate": "Present",
      "accomplishments": [
        "Designed and implemented a new polyglot build system built on Nx with a full plugin architecture",
        "Integrated Nx across distributed repositories using Java, Go, Jib, Helm, Python, and npm",
        "Built a polyglot release engine to unify and standardize release processes across stacks",
        "Automated GitLab CI pipeline generation, removing manual overhead and improving long-term maintainability",
        "Enhanced CI/CD performance through Distributed Task Execution and optimized caching across multiple GitLab runners",
        "Implemented end-to-end test coverage with Playwright, along with targeted test suites validating the build system to ensure reliability, reproducibility, and architectural integrity",
        "Introduced AI-powered tooling to assist with code analysis, architecture validation, and developer workflows, improving productivity and decision-making across teams",
        "Provided continuous coaching and support to engineering teams adopting Nx and modern development practices",
        "Planned and initiated the migration of hundreds of repositories into the internal cloud platform"
      ],
      "skills": [
        "Monorepo (Nrwl/Nx)",
        "TypeScript",
        "Maven",
        "GitLab",
        "OpenAPI Specification (OAS)",
        "Cypress",
        "Playwright",
        "ReactJS",
        "npm",
        "pnpm",
        "mise",
        "Continuous Integration (CI)",
        "Micro Frontends Architecture",
        "Single SPA",
        "SystemJS",
        "Webpack Module Federation",
        "Java",
        "Go",
        "Python",
        "Helm",
        "Jib",
        "AI-assisted Development"
      ]
    },
    {
      "role": "Nx Consultant & Full Stack Development Architecture",
      "companyName": "Caseware",
      "companyLogo": "/companies/caseware.jpeg",
      "companyURL": "https://www.linkedin.com/company/caseware-international-inc/posts/?feedView=all",
      "location": "Remote",
      "description": "Collaborated with the Dev Success Team to maintain and improve a large Central Monorepo (~900 projects) alongside multiple Distributed Monorepos. As an Nx expert, implemented an architecture designed to maximize the benefits of the Nx ecosystem.",
      "startDate": "2024-03-01",
      "endDate": "2025-02-28",
      "accomplishments": [
        "Upgraded Nx from v16 to v19.8",
        "Refactored custom utilities from legacy Project Configuration to Nx's Project Graph",
        "Unified and simplified the Monorepo architecture by leveraging Nx Plugins",
        "Unified workflows across multiple tech stacks (JavaScript/TypeScript, Java, Python, Go, .NET)",
        "Streamlined CI/CD GitHub workflows",
        "Paired and coached development teams for better Monorepo integration",
        "Implemented a new CI-managed release process",
        "Contributed to task organization for the Dev Success Team"
      ],
      "skills": [
        "TypeScript",
        "Monorepo Architecture",
        "Micro-Frontends Architecture",
        "Nx",
        "Angular",
        "NestJs",
        "GitHub",
        "Webpack",
        "Jest",
        "ESLint",
        "Cypress",
        "DevOps",
        "NodeJs",
        "Yarn",
        "Pnpm",
        "OpenAPI",
        "Webstorm",
        "GitHub Actions",
        "GitHub Copilot",
        "Java",
        "Python",
        "Go",
        ".NET"
      ]
    },
    {
      "role": "Architect Team Lead",
      "companyName": "Entain",
      "companyLogo": "/companies/entain.jpeg",
      "companyURL": "https://www.linkedin.com/company/entain/posts/?feedView=all",
      "location": "Remote",
      "description": "Oversaw the migration of multiple repositories and projects into an Nx monorepo for Entain. Developed the migration strategy, conducted coaching and pairing sessions with developers, configured the CI/CD pipeline, and ensured effective use of tools to uphold best development practices.",
      "startDate": "2023-06-01",
      "endDate": "2023-12-31",
      "accomplishments": [
        "Architected the monorepo with a focus on Angular and .Net",
        "Developed a migration kit with monorepo conventions to streamline integration of external repositories",
        "Deployed various Nx plugins to create custom executors and generators",
        "Established a new process to build multiple themes and integrate them seamlessly into various applications",
        "Implemented a new CI-managed release process",
        "Executed a full CI/CD implementation on GitLab, incorporating Distributed Task Execution and Distributed Caching",
        "Enforced best development practices to ensure long-term quality and maintainability",
        "Led weekly meetings for project updates and progress tracking",
        "Organized and generated tasks for the architecture team"
      ],
      "skills": [
        "Nx",
        ".NET",
        "CI/CD",
        "GitLab",
        "Distributed Task Execution",
        "Distributed Caching",
        "Monorepo Strategy",
        "Development Coaching",
        "Angular",
        "TypeScript"
      ]
    },
    {
      "role": "Software Architect & Tech Lead & Mentoring",
      "companyName": "Selligent Marketing Cloud",
      "companyLogo": "/companies/marigold.jpeg",
      "companyURL": "https://www.linkedin.com/company/meet-marigold/posts/?feedView=all",
      "location": "Hasselt, Flanders Region, Belgium · Remote",
      "description": "Established the new frontend architecture across multiple teams, including coaching/pairing with developers, configuring CI/CD pipelines, and ensuring adherence to best development practices. Migrated a large AngularJS application to a micro-frontend architecture.",
      "startDate": "2020-04-01",
      "endDate": "2023-06-30",
      "accomplishments": [
        "Designed the monorepo architecture to group applications, libraries, shared components, and e2e tests",
        "Implemented a micro-frontend architecture using single-spa and Angular",
        "Configured e2e testing processes and tooling using Cypress",
        "Delivered a full CI/CD implementation with Azure DevOps, supporting incremental development",
        "Established best development practices to ensure long-term quality and maintainability",
        "Coached developers on JavaScript functional programming, CI/CD, XP (pair programming, code reviews, training), BDD, and TDD",
        "Coached clients on adopting an agile mindset and continuous development practices"
      ],
      "skills": [
        "NodeJS",
        "TypeScript",
        "RxJS",
        "Angular",
        "Tailwind",
        "Storybook",
        "Webpack",
        "Monorepo",
        "Micro-Frontend",
        "Single-spa",
        "Module Federation",
        "SystemJS",
        "ESLint",
        "SonarQube",
        "OpenAPI",
        "Nrwl Nx",
        "SASS",
        "Angular Material",
        "Jest",
        "Cypress",
        "Yarn",
        "WebStorm",
        "Azure DevOps",
        "Docker",
        "Jira",
        "Git",
        "Azure App Insights",
        "Azure Storage"
      ]
    },
    {
      "role": "Software Architect & Tech Lead & Agile Coach",
      "companyName": "Thalys",
      "companyLogo": "/companies/thalys.jpeg",
      "companyURL": "https://www.linkedin.com/company/thalys-international/posts/?feedView=all",
      "location": "Brussels Region, Belgium · Hybrid",
      "description": "Configured and led a full-stack software development team, following the Spotify squad model. Supported the team by implementing core architectural components and coaching them on eXtreme Programming (XP) principles. Acted as a bridge between customers and users, guiding them through Agile principles and fostering a continuous development workflow.",
      "startDate": "2018-11-01",
      "endDate": "2020-04-30",
      "accomplishments": [
        "Architected a monorepo grouping backend services, frontends, and shared libraries",
        "Designed a frontend architecture with reusable components across multiple applications",
        "Collaborated with the team to define key UI/UX ergonomics",
        "Developed a backend architecture based on microservices",
        "Implemented a caching system using Redis to enhance overall performance",
        "Delivered a full CI/CD pipeline using Docker in a Kubernetes environment",
        "Established best development practices to ensure long-term quality and maintainability",
        "Coached developers on JavaScript functional programming, CI/CD, and XP practices",
        "Configured authentication and authorization using Azure AD and centralized roles",
        "Designed the business domain model in collaboration with customers",
        "Configured the Kanban board with the team to optimize task management",
        "Set up metrics and reporting to improve team velocity and enhance user satisfaction",
        "Coached customers on Agile methodologies and continuous development",
        "Mentored other internal development teams on various architectural topics"
      ],
      "skills": [
        "TypeScript",
        "Node.js",
        "Tailwind CSS",
        "Angular",
        "Azure DevOps",
        "Monorepo (Nrwl/Nx)",
        "RxJS",
        "GraphQL",
        "NestJS",
        "Postman API",
        "Yarn",
        "Cypress",
        "Jest",
        "Microsoft Azure",
        "Agile Methodologies",
        "Kanban",
        "GitLab",
        "Docker",
        "Kubernetes",
        "Sass",
        "Redis"
      ]
    },
    {
      "role": "Software Architect & Mentoring",
      "companyName": "Fednot",
      "companyLogo": "/companies/fednot.jpeg",
      "companyURL": "https://www.linkedin.com/company/fednot/posts/?feedView=all",
      "location": "Brussels Region, Belgium · On-site",
      "description": "Served as the Angular expert, responsible for the frontend architecture used by new Fednot applications. Provided pair coaching and maintained code quality by creating common best practices and components. Also acted as a scrum master, sharing experience in Agile, backend development, and DevOps.",
      "startDate": "2017-10-01",
      "endDate": "2018-12-31",
      "accomplishments": [
        "Configured a 'Monorepo' to share Angular/Javascript libraries across applications",
        "Specified good practices related to frontend development",
        "Coached developers in Angular",
        "Coached developers in XP: programming, reviewing, and testing",
        "Worked as a scrum master, defining team workflow with the team",
        "Participated in backend architecture specifications based on microservices"
      ],
      "skills": [
        "Angular 2+",
        "Angular CLI",
        "Redux",
        "RxJS",
        "TypeScript",
        "SASS",
        "Angular Material",
        "Jest",
        "Cypress",
        "OpenAPI (Swagger)",
        "NodeJS",
        "Yarn",
        "Webstorm",
        "Postman",
        "Bamboo",
        "Jira",
        "Confluence",
        "Git"
      ]
    },
    {
      "role": "Software, Front-end Architect",
      "companyName": "Sodexo",
      "companyLogo": "/companies/sodexo.jpeg",
      "companyURL": "https://www.linkedin.com/company/sodexo/posts/?feedView=all",
      "location": "Remote",
      "description": "Responsible for the new front-end architecture for all Sodexo applications. Provided proof of concepts, samples, documentation, coaching, patterns, and ways of working.",
      "startDate": "2017-01-01",
      "endDate": "2017-09-30",
      "accomplishments": [
        "Configured a 'Monorepo' to share Angular/Javascript libraries across applications",
        "Developed libraries for dynamic forms, translation/localization, authentication, remote services, notifications, and error management",
        "Defined and configured a CI process using GoCD and Docker (libraries: build, lint, test, e2e, release, publish on nexus; applications: build, lint, test, e2e, release, deploy on AWS)",
        "Specified and automated unit tests using Karma and Jest",
        "Worked as a scrum master, specifying Jira workflows",
        "Participated in microservices backend architecture specifications"
      ],
      "skills": [
        "Angular 2/4+",
        "Angular CLI",
        "Redux",
        "RxJS",
        "TypeScript",
        "SASS",
        "Bootstrap 4",
        "Karma",
        "Mocha",
        "Selenium",
        "Jest",
        "Protractor",
        "OpenAPI (Swagger)",
        "NodeJS",
        "Yarn",
        "ExpressJS",
        "IntelliJ",
        "Postman",
        "GoCD",
        "Jira",
        "Confluence",
        "Git",
        "Docker",
        "Nginx",
        "AWS"
      ]
    },
    {
      "role": "Senior Java/AngularJS Developer",
      "companyName": "SWIFT",
      "companyLogo": "/companies/swift.jpeg",
      "companyURL": "https://www.linkedin.com/company/swift/posts/?feedView=all",
      "location": "La Hulpe, Walloon Region, Belgium · On-site",
      "description": "Responsible for architecture and development (frontend and backend) of a web application used to screen customers.",
      "startDate": "2016-01-01",
      "endDate": "2016-12-31",
      "accomplishments": [
        "Coached the team in Agile practices",
        "Reviewed backend architecture, simplifying Maven configurations and splitting the application into modules",
        "Implemented OAuth 2 alongside SAML using Spring Security",
        "Improved usage of Spring frameworks",
        "Integrated a build framework using Grunt and Webpack with ES6",
        "Reviewed folder structure for a business view",
        "Refactored to use Angular components instead of large monolithic pages",
        "Defined the full continuous integration process using Jenkins pipelines",
        "Defined and coached the team on GIT and JIRA workflows"
      ],
      "skills": [
        "AngularJS",
        "Grunt/Webpack",
        "NodeJS",
        "Java 8",
        "Spring",
        "Spring-Boot",
        "Hibernate",
        "Jersey",
        "Maven",
        "Jenkins",
        "Oracle",
        "IntelliJ",
        "Git",
        "Jira",
        "Confluence",
        "RedHat",
        "SAML",
        "OAuth 2"
      ]
    },
    {
      "role": "Senior Node.js Developer",
      "companyName": "RTBF",
      "companyLogo": "/companies/rtbf.jpeg",
      "companyURL": "https://www.linkedin.com/company/rtbf/posts/?feedView=all",
      "location": "Schaerbeek, Brussels Region, Belgium · On-site",
      "description": "Responsible for the analysis, development, and architecture of an application to register user behaviors for a future recommendation algorithm.",
      "startDate": "2015-11-01",
      "endDate": "2015-12-31",
      "accomplishments": [
        "Performed functional and technical analysis",
        "Defined the data model",
        "Defined user actions to track",
        "Implemented the front-end script",
        "Implemented the NodeJS module",
        "Performed performance tests using Apache Bench"
      ],
      "skills": ["EcmaScript 6", "NodeJS", "KoaJS", "Gulp", "Babel", "Atom", "NodeLoad", "Redis", "Elasticsearch", "Git"]
    },
    {
      "role": "Senior AngularJS Developer",
      "companyName": "Edebex, Belgium",
      "companyLogo": "/companies/edebex.jpeg",
      "companyURL": "https://www.linkedin.com/company/edebex/posts/?feedView=all",
      "location": null,
      "description": "Responsible for analysis, development, and architecture (frontend and backend) of a web application to help companies sell invoices at lower prices.",
      "startDate": "2015-04-01",
      "endDate": "2015-10-31",
      "accomplishments": [
        "Provided estimation support (functional analysis and workload estimation)",
        "Designed the application (defined microservices architecture, AngularJS team development conventions/rules, and OAuth2 security solution)",
        "Implemented functionalities (refactored existing code, enhanced architecture, tested functionalities using JUnit)",
        "Provided IT support (coached and supported trainees, reviewed code, supported application users)"
      ],
      "skills": [
        "Java 8",
        "Spring Boot",
        "Javascript",
        "HTML5",
        "AngularJS",
        "Bootstrap",
        "CSS",
        "Docker",
        "IntelliJ",
        "Git",
        "Gulp",
        "NodeJS",
        "Hibernate",
        "MySQL",
        "Jenkins",
        "Jira",
        "JUnit",
        "Mockito",
        "Scrum",
        "OAuth2"
      ]
    },
    {
      "role": "Java Senior Developer & Scrum Master",
      "companyName": "Thales, Belgium",
      "companyLogo": "/companies/thales.jpeg",
      "companyURL": "https://www.linkedin.com/company/thales/posts/?feedView=all",
      "location": "Tubize",
      "description": "Responsible for development and architecture of an easy-to-use application to set networks of different radio systems.  Worked within a six-programmer team.",
      "startDate": "2013-11-01",
      "endDate": "2015-03-31",
      "accomplishments": [
        "Provided estimation support (functional analysis and workload estimation)",
        "Designed the application (defined solution to split application into plugins, continuous delivery process (Maven/Jenkins), team development rules, and license control solution)",
        "Implemented functionalities (refactored code, enhanced architecture, configured team environments, integrated automatic processes, tested functionalities using JUnit)",
        "Provided IT support (solved performance issues, reviewed code)"
      ],
      "skills": [
        "Java/JEE",
        "Swing",
        "Hibernate 3",
        "Spring 4",
        "JGraphX",
        "JIDE",
        "Maven",
        "Jenkins",
        "Confluence",
        "TinyPM",
        "JUnit",
        "H2 DB",
        "XML",
        "Eclipse",
        "IntelliJ",
        "Git",
        "UML",
        "YED",
        "Excelsior",
        "EasyMock",
        "Scrum"
      ]
    },
    {
      "role": "Java/JS Lead Developer",
      "companyName": "ADNEOM",
      "companyLogo": "/companies/adneom.jpeg",
      "companyURL": "https://www.linkedin.com/company/adneom/posts/?feedView=all",
      "location": "Brussels, Belgium",
      "description": "Responsible for development and architecture of a new web application (PC & Mobile) with three main tools: Aperform (tracking external employee progress), Atranet (managing internal tools), and Avolution (supporting employee career progression). Worked within a three-programmer team.",
      "startDate": "2013-08-01",
      "endDate": "2013-10-31",
      "accomplishments": [
        "Provided business support (technical solution proposals and workload estimation)",
        "Designed the application (defined technical architecture, frontend/backend communication, and entity relationships)",
        "Implemented functionalities (implemented Aperform functionalities and the administration part)",
        "Provided IT support (managed release deployment, coached programmers, reviewed code, solved production issues)"
      ],
      "skills": [
        "HTML 5",
        "AngularJS",
        "JQuery",
        "Twitter Bootstrap",
        "Node.JS",
        "LESS",
        "CSS",
        "Java/JEE",
        "Maven",
        "Jetty",
        "Spring",
        "Spring MVC",
        "Hibernate",
        "MySQL",
        "IntelliJ",
        "Git",
        "GitHub",
        "Jira",
        "Putty"
      ]
    },
    {
      "role": "Senior J2Ee Developer",
      "companyName": "Roularta Media Group",
      "companyLogo": "/companies/roularta.jpeg",
      "companyURL": "https://www.linkedin.com/company/roularta-media-group/",
      "location": "Louvain-La-Neuve, Belgium",
      "description": "Responsible for development and analysis of the 'International Information Gateway' (IIG) application, used to request data on international companies via web services.",
      "startDate": "2012-08-01",
      "endDate": "2013-07-31",
      "accomplishments": [
        "Provided estimation support (functional analysis and workload estimation)",
        "Designed the application (performed global refactoring, defined WSDL files, and defined the technical architecture)",
        "Implemented functionalities (created a cache implementation, generated Axis2 classes using 'wsdl2code', gathered business requirements, implemented XML mappings using XSLT, tested functionalities using JUnit and SoapUI)",
        "Provided IT support (solved production issues, reviewed code)"
      ],
      "skills": [
        "Java/JEE",
        "JSP",
        "JSTL",
        "XSLT",
        "JUnit",
        "Axis2",
        "HTML",
        "JS",
        "CSS",
        "Tomcat 7",
        "MySQL",
        "XML",
        "Eclipse",
        "Subversion",
        "Jira",
        "Putty",
        "DocuWiki",
        "WSDL"
      ]
    },
    {
      "role": "Consultant Java/JEE",
      "companyName": "Thalys International (ADNEOM)",
      "companyLogo": "/companies/thalys.jpeg",
      "companyURL": "https://www.linkedin.com/company/thalys-international/posts/?feedView=all",
      "location": "Brussels, Belgium",
      "description": "Lead developer (1-4 developers) on a fixed-price maintenance contract for two Thalys applications: Localys (real-time traffic monitoring) and Opalys (statistical reporting).",
      "startDate": "2011-04-01",
      "endDate": "2012-07-31",
      "accomplishments": [
        "Provided estimation support (functional retro analysis, workload estimation, workload scheduling)",
        "Designed the application (refactored legacy architecture, improved layering and loose coupling using Spring, improved MOM by migrating from JBossMQ to HornetQ, improved persistence by migrating from Oracle 8 to Oracle 11G)",
        "Implemented functionalities (gathered business requirements, implemented using POJO + Spring + Struts (Localys) and POJO + Spring + Swing + POI-HSSF (Opalys), performed unit and integration tests)",
        "Provided acceptance support (defined test plans and provisioned environments)",
        "Provided IT support (defined environments, implemented virtualization using VMware, automated environment configuration, solved production issues, defined migration plans)",
        "Committed to fixed-price constraints (managed time, validation, and follow-up activities through Jira Studio)"
      ],
      "skills": [
        "Java/JEE",
        "Spring",
        "Struts",
        "Hibernate",
        "Swing",
        "JSP",
        "JSTL",
        "JMS",
        "JUnit",
        "POI-HSSF",
        "HTML",
        "JS",
        "CSS",
        "JBoss",
        "Oracle 11G XE",
        "MySQL",
        "XML",
        "IntelliJ",
        "Subversion",
        "Jira",
        "VMware",
        "HornetQ",
        "JBossMQ"
      ]
    },
    {
      "role": "JEE Developer",
      "companyName": "I.R.I.S. Product and Technologies (European Commission)",
      "companyLogo": "/companies/iris.jpeg",
      "companyURL": "https://www.linkedin.com/company/irisgroup/",
      "location": "Brussels, Belgium",
      "description": "Responsible for analysis, development, and maintenance of two applications: TMS (resource booking and management) and JCSWeb (reporting application based on TMS data). Worked within a four-developer team.",
      "startDate": "2007-05-01",
      "endDate": "2011-03-31",
      "accomplishments": [
        "Participated in functional analysis and wrote analysis documentation using European Commission templates (RUP implementation)",
        "Implemented functionalities (improved usability of HTML forms using Ajax, designed and implemented PDF reports using iText, designed and implemented an applet for automatic PDF printing, created scheduled Oracle procedures)",
        "Provided acceptance support (wrote test scenarios, provisioned environments, created and executed performance tests using Apache JMeter)",
        "Wrote documentation for knowledge transfer to new developers"
      ],
      "skills": [
        "Java/JEE",
        "Struts",
        "JSP",
        "JSTL",
        "HTML",
        "JS",
        "CSS",
        "WebLogic",
        "Oracle 10G",
        "XML",
        "Eclipse",
        "CVS",
        "Toad",
        "Word",
        "iText",
        "Apache JMeter",
        "RUP",
        "PL/SQL",
        "Ajax"
      ]
    },
    {
      "role": "Cold Fusion Developer",
      "companyName": "European Commission",
      "companyLogo": "/companies/european-commission.jpeg",
      "companyURL": "https://www.linkedin.com/company/european-commission/",
      "location": "Brussels, Belgium",
      "description": "Maintained the iPerseus application used by European delegations for reporting economic data.  Also implemented new HTML/ColdFusion forms and various applications for DG ELARG.",
      "startDate": "2006-09-01",
      "endDate": "2007-05-31",
      "accomplishments": [
        "Integrated the European security framework (ECAS authentication service and user role-based authorization)",
        "Implemented new HTML/ColdFusion forms",
        "Performed maintenance (migration, updates)",
        "Implemented various applications using ColdFusion for DG ELARG",
        "Provided knowledge transfer to new developers"
      ],
      "skills": ["ColdFusion 6/8", "HTML", "JS", "CSS", "Dreamweaver CS4", "SVN", "Oracle 10G", "SQL/PLSQL", "Jira", "Toad", "ECAS"]
    }
  ],
  "recommendations": [
    {
      "name": "Jose Badeau",
      "picture": "/people/jose-badeau.jpeg",
      "role": "Head of Technical Excellence at Caseware",
      "content": "Jonathan joined us on a short six-month contract to help plug a gap in our team and tidy up some internal build tooling. Very quickly, it became clear he was having a much bigger impact, and he ended up staying with us for a year. During that time, he reshaped how we think about and work with our tooling from the ground up.\n\nHe reworked our build setup into a clean, Nx-based architecture with clear conformance standards, making day-to-day development simpler and more consistent while raising the bar on quality and maintainability. Jonathan also brought strong AI skills to the table, introducing AI carefully and intentionally, only where it genuinely made sense for the team and the product.\n\nOn a personal level, Jonathan is enthusiastic about new technology but refreshingly pragmatic and outcome-focused. He is deeply test-driven and helped us put snapshot-based end-to-end testing in place, which massively increased our confidence in releases and noticeably improved the overall developer experience.\n\nIf you're a company looking to streamline your tooling, improve engineering standards, and make life easier for your developers, I couldn't recommend Jonathan more highly."
    },
    {
      "name": "Miguel Perez Sanchis",
      "picture": "/people/miguel-perez-sanchis.jpeg",
      "role": "Software Engineer at Julius Baer",
      "content": "I have had the pleasure to work with Jonathan for around a year, and I can only recommend him for any software development team.\n\nHe has the energy and passion, the vision, and technical expertise to drive a team, suggest roadmaps, and implement solutions at an amazing speed and quality. Our project had to manage a wide range of technologies (Maven, Typescript in Node, Jib, Helm, GitLab pipelines, build caching, parallel builds, etc.) and he has been helpful in all aspects.\n\nI am glad I have had the opportunity of working with him, and so will be the engineers of any project he will decide to join in the future."
    },
    {
      "name": "Ekaterina Zaytseva",
      "picture": "/people/ekaterina-zaytseva.svg",
      "role": "Dev Success @ Caseware",
      "content": "I had the pleasure of working alongside Jonathan during his time with our team, where he made an invaluable impact as an expert in Nx and Typescript. Jonathan immediately set himself apart by designing a clear and actionable path from our current state to the ideal state of monorepo management. His strategic vision, combined with his ability to communicate complex technical concepts in an understandable way, was a key driver in our team's success.\n\nJonathan's approach to challenging the status quo was marked by a great deal of empathy and thoroughness. His ability to balance constructive critique with a focus on long-term improvement was invaluable.\n\nHis commitment to mentoring developers across the organization and producing extensive documentation played a crucial role in making complex processes accessible to the broader team.\n\nJonathan is a true professional—highly knowledgeable, collaborative, and dedicated to improving the development experience for everyone around him. I wholeheartedly recommend him for any role requiring deep technical expertise and a passion for driving impactful change."
    },
    {
      "name": "Karel Frederix",
      "picture": "/people/karel-frederix.jpeg",
      "role": "Senior Software Engineer at Marigold",
      "content": "I've had the privilege of collaborating with Jonathan for over two years at our organization, and I am thoroughly impressed by what he was able to achieve as a freelance Frontend Architect. Jonathan was entrusted with the challenge of leading our teams through the migration of a substantial legacy frontend codebase to a modern, state-of-the-art monorepo, employing a micro-frontend architecture utilizing Angular and Nx. This transition was monumental.\n\nBy the time of his departure, he had not only revolutionized our frontend development landscape but also equipped us with a solid foundation and the essential knowledge to keep innovating further. It felt to me like he moved a mountain, and it's incredible how much I learned from him.\n\nI highly recommend Jonathan to any organization seeking a visionary in modern frontend solutions."
    },
    {
      "name": "Maarten Cardinaels",
      "picture": "/people/maarten-cardinaels.jpeg",
      "role": "Tech lead at AvioBook",
      "content": "Working with Jonathan for some years now. He has proven to be a skilled architect, always aiming for solid,  clean and maintainable solutions.\n\nAt the same time he's a great mentor and coach, taking the time (over and over again) to explain complex topics in an understandable way, while challenging people allowing them to improve.\n\nLearned a lot from him both from a technical point of view as well as good developer mindset.\n\nDefinitely recommending him for a broad range of projects!"
    },
    {
      "name": "Ben Beckers",
      "picture": "/people/ben-beckers.jpeg",
      "role": "Software Engineer bij Selligent Marketing Cloud",
      "content": "Jonathan was the architect when we migrated from AngularJS to Angular.\n\nHe brought a lot (and I mean a lot) of knowledge to the company.\n\nFor me personally, he was able to break down difficult things into small bits so we/I could understand them.\nEven for domain specific things, he would come up with solid solutions.\nI have never learned this much from anyone, I'm not shy to say he made me a better frontend developer.\n\nAmazing asset to the company and a genuine nice person who cares a lot about his job!"
    },
    {
      "name": "Igor Kalders",
      "picture": "/people/igor-kalders.jpeg",
      "role": "Engineering Manager at Marigold",
      "content": "Jonathan is an extremely skilled front-end architect with the right mix of knowledge, patience and network to weigh in with authority. Apart from that, he sports a can-do mentality and manages to raise the quality bar across an Engineering department. Sound boarding with him does not get boring: never condescending, always enlightening.\n\nHe is one of those rare talents not everyone is lucky enough to work with in their lifetime. If you do, prepare to learn a lot."
    },
    {
      "name": "Yannick Stockmans",
      "picture": "/people/yannick-stockmans.jpeg",
      "role": ".NET Developer",
      "content": "Jonathan always had great advice and a clear vision on how to proceed."
    },
    {
      "name": "Steve Keyen",
      "picture": "/people/steve-keyen.jpeg",
      "role": "Full Stack Software Engineer",
      "content": "Working with Jon was a bliss, must-hire!"
    },
    {
      "name": "Hanaé Lépine",
      "picture": "/people/hanae-lepine.jpeg",
      "role": "En transition",
      "content": "J'ai travaillé avec Jonathan sur un projet de développement d'un outil IT pour les équipes Escales Thalys.\n\nJonathan a eu à cœur de transmettre ses connaissances avec le reste de l'équipe et a été garant du respect des principes Agile tout au long de notre projet. Son efficacité, son pragmatisme et son expérience nous ont permis de rester au plus près des besoins des utilisateurs et de leur proposer des design novateurs et intuitifs.\n\nJ'ai beaucoup appris à ses côtés."
    },
    {
      "name": "Sébastien Barbieri",
      "picture": "/people/sebastien-barbieri.jpeg",
      "role": "Research And Development Manager at RTBF",
      "content": "Jonathan has been working on a big data Proof of Concept project on a very short term notice. The project was successful and helped us setup a bunch of data to work on.\nHe is a person ready to take the opportunity to do something he doesn't know yet and learn from it.\nHe took the opportunity to enhance his javascript knowledge with us while we had the opportunity to see his ability to handle, document, present and manage a project till the end."
    },
    {
      "name": "Thierry Melkebeke",
      "picture": "/people/theirry-melkebeke.jpeg",
      "role": "Project Manager chez MEDIAGENIX",
      "content": "Jonathan a passé environ un mois en nos murs avec pour mission de développer du js le plus light possible dans le but final de proposer une contenu adapté à nos internautes. Tous s'est très bien passé, Techniquement, ses connaissances en js sont excellentes et c'est un collègue sympathique."
    },
    {
      "name": "Jon McLennan",
      "picture": "/people/jon-mclennan.jpeg",
      "role": "CTO/VP Engineering/Tech Lead",
      "content": "Jonathan was a tremendous asset for Edebex. He quickly integrated himself into the team, helped solidify our code and improved efficiency for the entire group. He is very knowledgable of many technical domains and can be counted on as a leader and a mentor."
    },
    {
      "name": "Oleg Korolenko",
      "picture": "/people/oleg-korolenko.jpeg",
      "role": "Lead Engineer at Disney Streaming",
      "content": "Jonathan joined our team as Senior Angular JS / Java developer in a quite difficult moment and accomplished a tremendous work in putting in place a front-end architecture with Angular Js using best practices and providing some quality code. Jonathan is great at coaching and challenging other team members to always go further to arrive to a better product."
    },
    {
      "name": "Jean-Louis Danthine",
      "picture": "/people/jean-louis-danthine.jpeg",
      "role": "IT Manager chez Trends Business Information",
      "content": "Jonathan had worked in our IT team during 1 year on a specific project.\nHe is creative and curious, on a technical and also a functional point of view.\nAttentive to the customer's needs, Jonathan delivers high quality outputs.\nHe made important contributions in the project, coordinating some releases and sharing knowledge with his co-workers."
    },
    {
      "name": "Laurent Merckx",
      "picture": "/people/laurent-merckx.jpeg",
      "role": "Java Senior Analyst / Developer",
      "content": "I've worked with Jonathan during several months. It was a real pleasure: the work was always qualitative, he had a good knowledge of the project and its implementation, he realized a very good monitoring of pending tasks and issues and the documentation was not forgotten."
    },
    {
      "name": "Richard GUITTER",
      "picture": "/people/richard-guitter.jpeg",
      "role": "Enterprise/Data Architect",
      "content": "Jonathan is a confirmed JEE developer.\nFirst of all he is trustworthy, which is the most important for a manager.\nRegarding technology, he is skilled in all the main java framework/API of the moment + some HTML/javascript design concepts. He is precise in his work.\nHumanly, he's a good work fellow: open and demanding."
    }
  ]
}
